#version: 0.2
Ġ Ġ
Ġ ĠĠĠ
ĠĠ ĠĠ
ĠĠĠ Ġ
i n
Ġ t
Ġ ĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠ
ĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠ ĠĠ
e r
Ġ ĠĠ
ĠĠ Ġ
o n
Ġ a
r e
a t
s t
e n
o r
Ġ th
Ġt h
Ċ Ċ
Ġ c
l e
Ġ s
i t
a n
a r
a l
Ġ the
Ġt he
Ġth e
; Ċ
Ġ p
Ġ f
o u
Ġ =
i s
Ġ ĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠ
ĠĠĠĠ ĠĠĠ
ĠĠĠ ĠĠĠĠ
ĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠ Ġ
i ng
in g
e s
Ġ w
i on
io n
e d
i c
Ġ b
Ġ d
e t
Ġ m
Ġ o
ĉ ĉ
r o
a s
e l
c t
n d
Ġ in
Ġi n
Ġ h
e nt
en t
i d
Ġ n
a m
Ġ ĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ Ġ
Ġ to
Ġt o
Ġ re
Ġr e
- -
Ġ {
Ġ of
Ġo f
o m
) ;Ċ
); Ċ
i m
č Ċ
Ġ (
i l
/ /
Ġ and
Ġa nd
Ġan d
u r
s e
Ġ l
e x
Ġ S
a d
Ġ "
c h
u t
i f
* *
Ġ }
e m
o l
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
t h
) Ċ
Ġ {Ċ
Ġ{ Ċ
Ġ g
i g
i v
, Ċ
c e
o d
Ġ v
a te
at e
Ġ T
a g
a y
Ġ *
o t
u s
Ġ C
Ġ st
Ġs t
Ġ I
u n
u l
u e
Ġ A
o w
Ġ '
e w
Ġ <
a tion
at ion
atio n
ati on
( )
Ġ for
Ġf or
Ġfo r
a b
o rt
or t
u m
a me
am e
Ġ is
Ġi s
p e
t r
c k
â Ģ
Ġ y
i st
is t
- ---
-- --
--- -
. ĊĊ
.Ċ Ċ
h e
Ġ e
l o
Ġ M
Ġ be
Ġb e
e rs
er s
Ġ on
Ġo n
Ġ con
Ġc on
Ġco n
a p
u b
Ġ P
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
a ss
as s
i nt
in t
> Ċ
l y
u rn
ur n
Ġ $
; ĊĊ
;Ċ Ċ
a v
p ort
por t
po rt
i r
- >
n t
c tion
ct ion
e nd
en d
Ġ de
Ġd e
i th
it h
o ut
ou t
t urn
tu rn
tur n
o ur
ou r
Ġ ĠĠĠĠ
ĠĠ ĠĠĠ
ĠĠĠĠ Ġ
ĠĠĠ ĠĠ
l ic
li c
r es
re s
p t
= =
Ġ this
Ġt his
Ġth is
Ġthi s
Ġ wh
Ġw h
Ġ if
Ġi f
Ġ D
v er
ve r
a ge
ag e
Ġ B
h t
e xt
ex t
= "
Ġ that
Ġt hat
Ġth at
Ġtha t
* ***
** **
*** *
Ġ R
Ġ it
Ġi t
e ss
es s
Ġ F
Ġ r
o s
a nd
an d
Ġ as
Ġa s
e ct
ec t
k e
r om
ro m
Ġ //
Ġ/ /
c on
co n
Ġ L
( "
q u
l ass
la ss
las s
Ġ with
Ġw ith
Ġwi th
Ġwit h
i z
d e
Ġ N
Ġ al
Ġa l
o p
u p
g et
ge t
Ġ }Ċ
Ġ} Ċ
i le
il e
Ġ an
Ġa n
a ta
at a
o re
or e
r i
Ġ pro
Ġp ro
Ġpr o
; čĊ
ĉ ĉĉĉ
ĉĉ ĉĉ
ĉĉĉ ĉ
t er
te r
a in
ai n
Ġ W
Ġ E
Ġ com
Ġc om
Ġco m
Ġ return
Ġre turn
Ġr eturn
Ġret urn
a rt
ar t
Ġ H
a ck
ac k
im port
imp ort
ub lic
ubl ic
Ġ or
Ġo r
e st
es t
m ent
me nt
men t
Ġ G
a ble
ab le
abl e
Ġ -
i ne
in e
i ll
il l
i nd
in d
e re
er e
: :
i ty
it y
Ġ +
Ġ tr
Ġt r
e lf
el f
i ght
ig ht
igh t
( '
o rm
or m
u lt
ul t
s tr
st r
. .
" ,
Ġ you
Ġy ou
Ġyo u
y pe
yp e
p l
Ġ new
Ġn ew
Ġne w
Ġ j
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġ from
Ġf rom
Ġfr om
Ġfro m
Ġ ex
Ġe x
Ġ O
l d
Ġ [
o c
: Ċ
Ġ se
Ġs e
Ġ le
Ġl e
- -------
-- ------
---- ----
--- -----
----- ---
------ --
------- -
. s
{ Ċ
' ,
a nt
an t
Ġ at
Ġa t
a se
as e
. c
Ġ ch
Ġc h
< /
a ve
av e
a ng
an g
Ġ are
Ġa re
Ġar e
Ġ int
Ġin t
Ġi nt
âĢ Ļ
_ t
e rt
er t
i al
ia l
a ct
ac t
} Ċ
i ve
iv e
o de
od e
o st
os t
Ġ class
Ġc lass
Ġcl ass
Ġclas s
Ġcla ss
Ġ not
Ġn ot
Ġno t
o g
o rd
or d
al ue
alu e
a ll
al l
f f
( );Ċ
() ;Ċ
(); Ċ
o nt
on t
i me
im e
a re
ar e
Ġ U
Ġ pr
Ġp r
Ġ :
i es
ie s
i ze
iz e
u re
ur e
Ġ by
Ġb y
i re
ir e
Ġ }ĊĊ
Ġ} ĊĊ
Ġ}Ċ Ċ
. p
Ġ sh
Ġs h
i ce
ic e
a st
as t
p tion
pt ion
pti on
t ring
tr ing
tri ng
o k
_ _
c l
# #
Ġ he
Ġh e
a rd
ar d
) .
Ġ @
i ew
ie w
ĉ ĉĉ
ĉĉ ĉ
Ġ was
Ġw as
Ġwa s
i p
t his
th is
Ġ u
Ġ The
ĠT he
ĠTh e
i de
id e
a ce
ac e
i b
a c
r ou
ro u
Ġ we
Ġw e
j ect
je ct
jec t
Ġ public
Ġp ublic
Ġpub lic
Ġpubli c
Ġpubl ic
a k
v e
a th
at h
o id
oi d
Ġ =>
Ġ= >
u st
us t
q ue
qu e
Ġ res
Ġre s
Ġr es
) )
' s
Ġ k
a ns
an s
y st
ys t
un ction
unc tion
unct ion
* *******
** ******
**** ****
****** **
*** *****
***** ***
******* *
Ġ i
Ġ us
Ġu s
p p
o ne
on e
a il
ai l
= ===
== ==
=== =
n ame
na me
nam e
Ġ str
Ġs tr
Ġst r
Ġ /
Ġ &
a ch
ac h
d iv
di v
y stem
yst em
ys tem
yste m
e ll
el l
Ġ have
Ġh ave
Ġha ve
Ġhav e
e rr
er r
o uld
ou ld
oul d
u ll
ul l
p on
po n
Ġ J
_ p
Ġ ==
Ġ= =
i gn
ig n
S t
. Ċ
Ġ pl
Ġp l
) ;ĊĊ
);Ċ Ċ
); ĊĊ
f orm
fo rm
for m
p ut
pu t
o unt
ou nt
oun t
} ĊĊ
}Ċ Ċ
d d
i te
it e
Ġ get
Ġg et
Ġge t
r r
o me
om e
Ġ âĢ
Ġâ Ģ
a ram
ar am
ara m
c c
Ġ */
Ġ* /
E R
I n
l es
le s
_ s
o ng
on g
i e
Ġ can
Ġc an
Ġca n
Ġ V
e rv
er v
p r
Ġ un
Ġu n
r ow
ro w
b er
be r
Ġ do
Ġd o
l l
Ġ el
Ġe l
Ġ self
Ġs elf
Ġse lf
Ġsel f
a ted
at ed
ate d
a ry
ar y
Ġ .
' ]
u d
Ġ en
Ġe n
Ġ Th
ĠT h
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
t e
_ c
u ct
uc t
Ġ ab
Ġa b
o rk
or k
. get
.g et
.ge t
Ġ #
a w
r ess
re ss
res s
o b
N ame
Na me
Nam e
a pp
ap p
[ '
Ġ all
Ġa ll
Ġal l
o ry
or y
i tion
it ion
iti on
a nce
an ce
anc e
e ar
ea r
Ġ cont
Ġc ont
Ġcon t
Ġco nt
v ent
ve nt
ven t
i a
Ġ will
Ġw ill
Ġwi ll
Ġwil l
I N
Ġ ĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ Ġ
ĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠ
r eturn
re turn
ret urn
Ġ </
Ġ< /
d ata
da ta
dat a
) ĊĊ
)Ċ Ċ
R e
p le
pl e
i ld
il d
t her
th er
the r
Ġ your
Ġy our
Ġyou r
Ġyo ur
" Ċ
( $
Ġ out
Ġo ut
Ġou t
) ,
Ġ has
Ġh as
Ġha s
S tring
St ring
Str ing
s o
Ġ up
Ġu p
a x
Ġ def
Ġd ef
Ġde f
Ġ bo
Ġb o
g e
a lse
al se
als e
O N
p er
pe r
i ch
ic h
Ġ but
Ġb ut
Ġbu t
Ġ Ċ
Ġ _
_ m
a dd
ad d
q uest
qu est
que st
ques t
o del
od el
ode l
s elf
se lf
sel f
e ry
er y
f t
e ns
en s
/ ///
// //
/// /
a ke
ak e
. C
Ġ go
Ġg o
Ġ function
Ġf unction
Ġfun ction
Ġfunc tion
Ġfunct ion
Ġ K
i vate
iv ate
iva te
ivat e
Ġ im
Ġi m
Ġ const
Ġcon st
Ġco nst
Ġcons t
. t
Ġ */Ċ
Ġ* /Ċ
Ġ*/ Ċ
) ;čĊ
); čĊ
Ġ void
Ġv oid
Ġvo id
Ġvoi d
Ġ set
Ġs et
Ġse t
Ġ System
ĠS ystem
ĠSy stem
ĠSys tem
c ri
cr i
( )Ċ
() Ċ
l i
ĉ if
ĉi f
. m
al ly
all y
s et
se t
e p
âĢĻ s
b o
d ef
de f
' ,Ċ
', Ċ
Ġ me
Ġm e
Ġ !
at ch
" >
" ,Ċ
", Ċ
e c
Ġ In
ĠI n
p h
Ġ |
_ f
Ġ var
Ġv ar
Ġva r
e nce
en ce
enc e
I d
r ee
re e
i nk
in k
l ect
le ct
lec t
u g
e th
et h
Ġ else
Ġe lse
Ġel se
Ġels e
- ---------------
-- --------------
---- ------------
-------- --------
--- -------------
------------ ----
----- -----------
---------- ------
------ ----------
----------- -----
------------- ---
------- ---------
--------- -------
--------------- -
-------------- --
c ont
con t
co nt
Ġ so
Ġs o
a tic
at ic
ati c
Ġ lo
Ġl o
p ro
pr o
t on
to n
s s
o wn
ow n
a bel
ab el
abe l
o int
oin t
oi nt
o us
ou s
e ld
el d
S T
T he
Th e
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
R E
" :
o lor
ol or
olo r
t p
e g
k ey
ke y
u de
ud e
Ġ St
ĠS t
o und
ou nd
oun d
Ġ ar
Ġa r
" );Ċ
") ;Ċ
"); Ċ
e ner
en er
ene r
s er
se r
b ject
bj ect
ess age
essa ge
f er
fe r
Ġ more
Ġm ore
Ġmor e
Ġmo re
a tions
at ions
ation s
atio ns
ati ons
e nts
en ts
ent s
Ġ his
Ġh is
Ġhi s
Ġ they
Ġt hey
Ġth ey
Ġthe y
. S
Ġ Y
u se
us e
n e
i sh
is h
o ld
ol d
_ d
i o
i eld
ie ld
iel d
Ġ per
Ġp er
Ġpe r
C ont
Con t
Co nt
in gs
ing s
# ###
## ##
### #
Ġ data
Ġd ata
Ġda ta
Ġdat a
Ġ sa
Ġs a
e f
f o
Ġ one
Ġo ne
Ġon e
e ng
en g
Ġ dis
Ġd is
Ġdi s
A T
Ġ name
Ġn ame
Ġna me
Ġnam e
Ġ true
Ġtr ue
Ġtru e
v al
va l
l ed
le d
. f
Ġ ne
Ġn e
Ġ end
Ġe nd
Ġen d
. T
c re
cr e
a rk
ar k
l og
lo g
E x
e rror
er ror
err or
erro r
_ id
_i d
ur re
urr e
a nge
an ge
ang e
Ġ null
Ġn ull
Ġnu ll
r ray
rr ay
Ġ my
Ġm y
p an
pa n
i ct
ic t
a tor
at or
ato r
V iew
Vi ew
L ist
Li st
ĉ return
ĉr eturn
ĉret urn
ĉre turn
âĢ Ŀ
Ġ pre
Ġp re
Ġpr e
Ġ x
c lude
cl ude
clud e
a rg
ar g
o v
. h
Ġ >
Ġ their
Ġthe ir
' )
i rst
ir st
irs t
i ck
ic k
g h
L E
O R
Ġ private
Ġpr ivate
Ġpriv ate
Ġpri vate
Ġprivat e
Ġpriva te
t em
te m
čĊ čĊ
u ser
us er
use r
Ġ )
c om
co m
. A
" ;Ċ
"; Ċ
Ġ id
Ġi d
r ead
re ad
rea d
Ġ who
Ġw ho
Ġwh o
_ b
" >Ċ
"> Ċ
Ġ time
Ġt ime
Ġtim e
Ġti me
Ġ man
Ġm an
Ġma n
r y
= =======
== ======
==== ====
=== =====
====== ==
===== ===
======= =
r oup
ro up
rou p
r op
ro p
p ublic
pub lic
v el
ve l
um ber
umb er
b le
bl e
Ġ which
Ġwh ich
******** ********
Ġ any
Ġa ny
Ġan y
Ġ false
Ġf alse
Ġfa lse
Ġfal se
Ġfals e
w e
Ġ value
Ġv alue
Ġval ue
Ġvalu e
Ġ li
Ġl i
" )
n der
nd er
nde r
g r
Ġ no
Ġn o
p aram
par am
pa ram
para m
f ig
fi g
. com
.c om
.co m
Ġ app
Ġa pp
Ġap p
_ l
i ons
ion s
io ns
. D
Ġ Ch
ĠC h
Ġ about
Ġa bout
Ġab out
Ġ add
Ġa dd
Ġad d
Ġ su
Ġs u
Ġ string
Ġs tring
Ġst ring
Ġstr ing
Ġstri ng
I D
Ġ over
Ġo ver
Ġov er
s tring
st ring
str ing
stri ng
. l
our ce
_ C
] Ċ
Ġ qu
Ġq u
Ġ String
ĠS tring
ĠSt ring
ĠStr ing
c a
S E
Ġ ro
Ġr o
s h
u al
ua l
T ype
Typ e
Ty pe
s on
so n
n ew
ne w
e rn
er n
Ġ ag
Ġa g
A R
] ;Ċ
]; Ċ
] .
Ġ ?
i cal
ic al
ica l
Ġ des
Ġd es
Ġde s
u th
ut h
i x
a ys
ay s
Ġ type
Ġt ype
Ġtyp e
Ġty pe
' t
a ult
au lt
aul t
Ġ inter
Ġin ter
Ġint er
Ġinte r
v ar
va r
. b
Ġ part
Ġp art
Ġpar t
Ġpa rt
. d
ur rent
urre nt
urr ent
I T
E N
e nc
en c
( f
r a
v alue
val ue
valu e
c ho
ch o
ut ton
utt on
utto n
o se
os e
Ġ !=
Ġ! =
a ter
at er
ate r
Ã ©
re ate
reat e
rea te
o ll
ol l
p os
po s
y le
yl e
n g
A L
u sing
us ing
usi ng
a mes
am es
ame s
Ġ {čĊ
Ġ{ čĊ
a tes
at es
ate s
e ly
el y
Ġ work
Ġw ork
Ġwor k
Ġwo rk
Ġ em
Ġe m
i nal
in al
ina l
Ġ sp
Ġs p
Ġ when
Ġw hen
Ġwh en
Ġwhe n
. set
.s et
.se t
Ġ ĠĠĠĠĠ
ĠĠ ĠĠĠĠ
ĠĠĠĠ ĠĠ
ĠĠĠ ĠĠĠ
ĠĠĠĠĠ Ġ
) :Ċ
): Ċ
t o
q uire
qu ire
quir e
qui re
in dow
ind ow
indo w
l ement
le ment
lem ent
lemen t
leme nt
p ect
pe ct
pec t
a sh
as h
[ i
Ġ use
Ġu se
Ġus e
. F
p ec
pe c
Ġ ad
Ġa d
o ve
ov e
ce ption
cept ion
cep tion
e ngth
eng th
in clude
inc lude
incl ude
a der
ad er
ade r
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
at us
atu s
T h
i tle
it le
r it
ri t
v oid
vo id
( ).
() .
( Ċ
Ġ off
Ġo ff
Ġof f
Ġ other
Ġo ther
Ġot her
Ġ &&
Ġ& &
' ;Ċ
'; Ċ
m s
Ġ been
Ġb een
Ġbe en
Ġbee n
Ġ te
Ġt e
m l
c o
n c
er vice
erv ice
Ġ %
* *Ċ
** Ċ
a nn
an n
a de
ad e
Ċ ĊĊĊ
ĊĊ ĊĊ
ĊĊĊ Ċ
l ock
lo ck
loc k
con st
co nst
cons t
pon se
pons e
Ġ sup
Ġs up
Ġsu p
+ +
d ate
da te
dat e
Ġ acc
Ġa cc
Ġac c
Ġ had
Ġh ad
Ġha d
Ġ bu
Ġb u
Ġ Re
ĠR e
Ġ were
Ġw ere
Ġwe re
Ġwer e
Ġ file
Ġf ile
Ġfil e
Ġfi le
Ġ would
Ġw ould
Ġwo uld
Ġ âĢľ
ĠâĢ ľ
v en
ve n
i ss
is s
Ġ our
Ġo ur
Ġou r
c lass
cl ass
cla ss
clas s
r aw
ra w
Ġ year
Ġy ear
Ġye ar
D ata
Da ta
Dat a
Ġ val
Ġv al
Ġva l
Ġ some
Ġs ome
Ġso me
Ġsom e
f ter
ft er
fte r
y s
Ġ ///
Ġ// /
Ġ/ //
r ound
ro und
rou nd
v iew
vi ew
vie w
Ġ pe
Ġp e
Ġ there
Ġt here
Ġth ere
Ġthe re
Ġther e
Ġ said
Ġs aid
Ġsa id
Ġsai d
d u
o f
l ine
li ne
lin e
/ *
d uct
du ct
duc t
Ġ her
Ġh er
Ġhe r
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
R es
Re s
Ġ co
Ġc o
Ġ comm
Ġc omm
Ġcom m
Ġco mm
i se
is e
m in
mi n
Ġ ĠĠĠĊ
ĠĠ ĠĠĊ
ĠĠĠĠ Ċ
ĠĠĠ ĠĊ
# include
et hod
eth od
. P
u te
ut e
Ġ ass
Ġa ss
Ġas s
I nt
In t
a sk
as k
l oc
lo c
Ġ like
Ġl ike
Ġli ke
Ġlik e
o dy
od y
Ġ let
Ġl et
Ġle t
l oad
lo ad
Ġ am
Ġa m
r ol
ro l
Ġ gr
Ġg r
y p
Ġ also
Ġal so
Ġals o
Ġ It
ĠI t
u rl
ur l
i fic
if ic
ifi c
o rs
or s
_ P
_ n
i gh
ig h
Ġ than
Ġt han
Ġth an
Ġtha n
C om
Co m
A N
U L
a ting
at ing
ati ng
atin g
Ġ This
ĠT his
ĠTh is
ĠThi s
r ef
re f
_ S
Ġ static
Ġst atic
Ġstat ic
Ġsta tic
Ġstati c
r oll
ro ll
rol l
Ġ just
Ġj ust
Ġju st
Ġjus t
Ġ result
Ġres ult
Ġresul t
i an
ia n
id th
Ġ them
Ġt hem
Ġth em
Ġthe m
) );Ċ
)) ;Ċ
)); Ċ
d er
de r
re ak
rea k
C on
Co n
: //
:/ /
u le
ul e
. ..
.. .
a rch
ar ch
arc h
e ment
em ent
eme nt
emen t
Ġ <<
Ġ< <
u sh
us h
en se
ens e
a rr
ar r
Ġ into
Ġin to
Ġint o
c ess
ce ss
ces s
a mp
am p
i ed
ie d
u ment
um ent
ume nt
umen t
Ġ \
] ,
w o
a ls
al s
Ġ what
Ġw hat
Ġwh at
a nc
an c
V alue
Val ue
= '
o lum
ol um
olu m
Ġ pos
Ġp os
Ġpo s
a ges
ag es
age s
a yer
ay er
aye r
Ġ sc
Ġs c
u es
ue s
" )Ċ
") Ċ
_ T
Ġ list
Ġl ist
Ġli st
Ġlis t
( s
Ġ case
Ġc ase
Ġca se
Ġcas e
C h
ĉ ĉĉĉĉ
ĉĉ ĉĉĉ
ĉĉĉĉ ĉ
ĉĉĉ ĉĉ
//// ////
/// /////
///// ///
p onent
pon ent
po nent
pone nt
Ġ z
Ġ kn
Ġk n
l et
le t
D E
r ed
re d
Ġ fe
Ġf e
Ġ },Ċ
Ġ} ,Ċ
Ġ}, Ċ
Ġ ,
( t
Ġ first
Ġf irst
Ġfi rst
Ġfir st
' );Ċ
') ;Ċ
'); Ċ
w ord
wo rd
wor d
Ġ import
Ġim port
Ġimp ort
Ġimpor t
Ġ act
Ġa ct
Ġac t
Ġ char
Ġc har
Ġch ar
Ġcha r
C T
Ġ Tr
ĠT r
o ple
op le
opl e
= {
ĉ f
i ent
ie nt
ien t
c ent
ce nt
cen t
. j
l ection
le ction
lect ion
lec tion
) )Ċ
)) Ċ
Ġ only
Ġon ly
Ġ print
Ġp rint
Ġpr int
Ġpri nt
Ġprin t
m er
me r
. W
o ck
oc k
Ġ --
Ġ- -
T ext
Te xt
Tex t
Ġ op
Ġo p
a nk
an k
Ġ its
Ġit s
Ġi ts
Ġ back
Ġb ack
Ġba ck
Ġbac k
[ "
Ġ need
Ġn eed
Ġne ed
Ġ cl
Ġc l
Ġ sub
Ġs ub
Ġsu b
Ġ la
Ġl a
( (
. "
O bject
Ob ject
Obj ect
Ġ start
Ġst art
Ġstar t
Ġsta rt
f ile
fi le
fil e
( self
(s elf
(se lf
(sel f
n er
ne r
e y
Ġ user
Ġu ser
Ġus er
Ġuse r
Ġ ent
Ġe nt
Ġen t
Ġ Com
ĠC om
ĠCo m
i ts
it s
Ġ Con
ĠC on
ĠCo n
o uble
ou ble
oub le
o wer
ow er
owe r
i tem
it em
ite m
v ery
ver y
ve ry
Ġ We
ĠW e
l ick
lic k
li ck
Ġ Q
p hp
ph p
t tp
tt p
' :
i cs
ic s
Ġ under
Ġu nder
Ġun der
Ġund er
Ġunde r
Ġ *Ċ
Ġ* Ċ
. L
) ;
i ces
ic es
ice s
Ġ reg
Ġre g
Ġr eg
) čĊ
ĉ public
ĉp ublic
ĉpub lic
S S
Ġ then
Ġt hen
Ġth en
Ġthe n
r eat
re at
rea t
i ous
io us
iou s
. G
e k
i rect
ir ect
ire ct
h eck
he ck
hec k
cri pt
cr ipt
crip t
n ing
ni ng
nin g
Ġ Un
ĠU n
Ġ may
Ġm ay
Ġma y
Ġ Wh
ĠW h
B o
I tem
It em
st ruct
str uct
stru ct
. st
.s t
r eam
re am
rea m
i ble
ib le
lo at
Ġ org
Ġo rg
Ġor g
u nd
un d
s um
su m
_ in
_i n
. ./
.. /
_ M
Ġ how
Ġh ow
Ġho w
r ite
ri te
rit e
' Ċ
T o
w w
Ġ people
Ġpe ople
in dex
ind ex
inde x
. n
h ttp
ht tp
htt p
( m
e ctor
ect or
ec tor
Ġ ind
Ġin d
Ġi nd
Ġ jav
Ġj av
Ġja v
] ,Ċ
], Ċ
Ġ He
ĠH e
_ st
_s t
f ul
fu l
o le
ol e
) {Ċ
){ Ċ
Ġ should
Ġsh ould
Ġsho uld
o py
op y
e lp
el p
i er
ie r
_ name
_n ame
_na me
er son
ers on
I ON
IO N
o te
ot e
Ġ test
Ġt est
Ġte st
Ġtes t
Ġ bet
Ġb et
Ġbe t
r ror
rr or
u lar
ul ar
ula r
ã Ģ
Ġ Ð
b s
t ing
ti ng
tin g
Ġ make
Ġm ake
Ġma ke
Ġmak e
T r
Ġ after
Ġa fter
Ġaf ter
Ġaft er
ar get
arg et
arge t
R O
ol umn
olum n
olu mn
r c
_ re
_r e
de fine
def ine
Ġ right
Ġr ight
Ġrig ht
Ġri ght
r ight
ri ght
rig ht
d ay
da y
Ġ long
Ġl ong
Ġlo ng
Ġlon g
[ ]
( p
t d
c ond
con d
co nd
Ġ Pro
ĠP ro
ĠPr o
Ġ rem
Ġre m
Ġr em
p tions
pt ions
ption s
pti ons
v id
vi d
. g
Ġ ext
Ġe xt
Ġex t
Ġ __
Ġ_ _
' )Ċ
') Ċ
p ace
pa ce
pac e
m p
Ġ min
Ġm in
Ġmi n
st ance
sta nce
stan ce
a ir
ai r
a ction
act ion
ac tion
w h
t ype
ty pe
typ e
u til
ut il
uti l
a it
ai t
< ?
I C
t ext
te xt
tex t
Ġ ph
Ġp h
Ġ fl
Ġf l
. M
c cess
cc ess
cce ss
b r
f ore
fo re
for e
ers ion
ersi on
) ,Ċ
), Ċ
. re
.r e
a teg
at eg
ate g
Ġ loc
Ġl oc
Ġlo c
i ns
in s
- s
t rib
tr ib
tri b
Ġ Int
ĠI nt
ĠIn t
Ġ array
Ġa rray
Ġar ray
Ġarr ay
Ġarra y
, "
P ro
Pr o
( c
ess ion
essi on
> ĊĊ
>Ċ Ċ
Ġ she
Ġs he
Ġsh e
" ]
a ph
ap h
Ġ exp
Ġe xp
Ġex p
er ty
ert y
Ġ Se
ĠS e
Ġ par
Ġp ar
Ġpa r
u nc
un c
E T
Ġ read
Ġre ad
Ġr ead
p rint
pr int
pri nt
prin t
Ġ rel
Ġre l
Ġr el
Ġ form
Ġf orm
Ġfor m
Ġfo rm
Ġ dr
Ġd r
Ex ception
Except ion
in put
inp ut
Ġ trans
Ġt rans
Ġtr ans
Ġtra ns
Ġtran s
# #######
## ######
#### ####
### #####
##### ###
###### ##
####### #
or der
ord er
orde r
B y
Ġ aw
Ġa w
i ties
it ies
iti es
u ff
uf f
p lay
pl ay
pla y
. add
.a dd
.ad d
Ġ âĢĵ
ĠâĢ ĵ
Ġ want
Ġw ant
Ġwa nt
Ġwan t
Ġ comp
Ġc omp
Ġcom p
Ġco mp
m ents
ment s
me nts
men ts
Ġ ||
Ġ| |
a z
b e
Ġ number
Ġn umber
Ġnum ber
Ġnumb er
Ġ require
Ġre quire
Ġreq uire
Ġrequ ire
Ġ Ex
ĠE x
Ġ col
Ġc ol
Ġco l
Ġ key
Ġk ey
Ġke y
em ber
emb er
Ġ two
Ġt wo
Ġtw o
Ġ size
Ġs ize
Ġsi ze
Ġsiz e
Ġ where
Ġw here
Ġwh ere
Ġwhe re
U T
res ult
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
o ugh
ou gh
oug h
or ld
o od
oo d
u ch
uc h
a tive
at ive
ati ve
ativ e
g er
ge r
a rent
ar ent
are nt
aren t
Ġ /*
Ġ/ *
Ġ arg
Ġa rg
Ġar g
Ġ while
Ġwh ile
( this
(t his
(th is
Ġ rec
Ġre c
Ġr ec
Ġ dif
Ġd if
Ġdi f
S tate
St ate
Stat e
Sta te
Ġ spec
Ġs pec
Ġsp ec
Ġspe c
r ide
ri de
rid e
_ F
Ġ look
Ġl ook
Ġlo ok
A M
il ity
ilit y
ili ty
e ter
et er
ete r
âĢĻ t
Ċ ĊĊ
ĊĊ Ċ
a yout
ay out
ayo ut
-- ------------------------------
---- ----------------------------
---------------- ----------------
------------ --------------------
---------------------------- ----
------------------------------ --
-------------------- ------------
a ger
ag er
age r
Ġ could
Ġc ould
Ġco uld
Ġcou ld
Ġ br
Ġb r
e nds
en ds
end s
u res
ur es
ure s
Ġ know
Ġk now
Ġkn ow
e ts
et s
Ġ If
ĠI f
Ġ Sh
ĠS h
. w
b ack
ba ck
bac k
Ġ ser
Ġs er
Ġse r
Ġ +=
Ġ+ =
Ġ fr
Ġf r
( ));Ċ
() );Ċ
()) ;Ċ
()); Ċ
Ġ hand
Ġh and
Ġha nd
Ġhan d
I nd
In d
U LL
UL L
I m
( );ĊĊ
() ;ĊĊ
();Ċ Ċ
(); ĊĊ
Ġ most
Ġm ost
Ġmo st
Ġmos t
Ġ try
Ġt ry
Ġtr y
Ġ now
Ġn ow
Ġno w
r ough
ro ugh
rou gh
> čĊ
ack age
Ġ him
Ġh im
Ġhi m
. _
i fy
if y
Ġ break
Ġb reak
Ġbre ak
Ġ );Ċ
Ġ) ;Ċ
Ġ); Ċ
r en
re n
# define
i tt
it t
Ġ ap
Ġa p
ĉ c
( n
Ġ You
ĠY ou
ĠYo u
: ĊĊ
:Ċ Ċ
- m
Ġ every
Ġe very
Ġever y
Ġev ery
Ġeve ry
us tom
ust om
usto m
l ient
li ent
lie nt
lien t
oc ument
cri ption
cript ion
crip tion
E rror
Err or
Er ror
Erro r
- b
Ð ¾
] [
t rans
tr ans
tra ns
tran s
Ġ point
Ġp oint
Ġpo int
Ġpoi nt
Ġ std
Ġs td
Ġst d
Ġ fil
Ġf il
Ġfi l
T ime
Tim e
Ti me
Ġ mod
Ġm od
Ġmo d
Ġ ->
Ġ- >
Ġ error
Ġe rror
Ġerr or
Ġer ror
Ġerro r
a h
Ġ text
Ġt ext
Ġte xt
Ġtex t
r oller
ro ller
rol ler
roll er
l ose
lo se
los e
q l
Ġ pol
Ġp ol
Ġpo l
> </
>< /
Ġ show
Ġs how
Ġsh ow
Ġsho w
U ser
Us er
Use r
a sed
as ed
ase d
Ġ {ĊĊ
Ġ{ ĊĊ
Ġ{Ċ Ċ
Ġ find
Ġf ind
Ġfin d
Ġfi nd
Ð °
E D
s pan
sp an
spa n
e nu
en u
Ġ current
Ġc urrent
Ġcur rent
Ġcurr ent
Ġ used
Ġu sed
Ġus ed
Ġuse d
ce pt
cep t
cl ud
Ġ play
Ġp lay
Ġpl ay
Ġpla y
Ġ log
Ġl og
Ġlo g
u tion
ut ion
uti on
f l
Ġ see
Ġs ee
Ġse e
ind ows
indow s
indo ws
Ġ help
Ġh elp
Ġhe lp
Ġhel p
Ġ these
Ġth ese
Ġthe se
Ġ pass
Ġp ass
Ġpas s
Ġpa ss
Ġ down
Ġd own
Ġdo wn
Ġdow n
Ġ even
Ġe ven
Ġev en
Ġeve n
a son
as on
aso n
u ild
ui ld
uil d
f rom
fr om
( d
Ġ bl
Ġb l
l abel
la bel
lab el
e lse
el se
els e
Ð µ
Ġ (!
Ġ( !
i zed
iz ed
ize d
( ),
() ,
Ġ ob
Ġo b
Ġ item
Ġit em
Ġi tem
u mp
um p
U R
o rn
or n
Ġ don
Ġd on
Ġdo n
S e
m an
ma n
am ple
amp le
t n
= ===============
== ==============
==== ============
======== ========
=== =============
============ ====
============= ===
=========== =====
============== ==
========= =======
========== ======
=============== =
====== ==========
===== ===========
======= =========
H e
g ram
gr am
gra m
Ġ did
Ġd id
Ġdi d
w n
_ h
i ver
iv er
ive r
Ġ sm
Ġs m
Ġ through
Ġth rough
Ġthr ough
Ġthro ugh
Ġ An
ĠA n
c he
ch e
Ġ inv
Ġin v
Ġi nv
o use
ou se
ous e
Ġ es
Ġe s
Ġ New
ĠN ew
ĠNe w
ex port
exp ort
expo rt
m ary
ma ry
mar y
u to
ut o
l er
le r
Ġ last
Ġl ast
Ġla st
Ġlas t
Ġ event
Ġe vent
Ġeven t
Ġev ent
Ġeve nt
t ry
tr y
ï ¼
i ly
il y
ig ned
ign ed
igne d
i nes
in es
ine s
ol low
oll ow
ollo w
ic ense
icens e
s ole
so le
sol e
l ear
le ar
lea r
( int
(i nt
(in t
Ġ again
Ġa gain
Ġag ain
Ġ high
Ġh igh
Ġhi gh
Ġhig h
h tml
ht ml
htm l
In dex
Ind ex
ut hor
uth or
Ġ /**Ċ
Ġ/ **Ċ
Ġ/* *Ċ
Ġ/** Ċ
Ġ line
Ġl ine
Ġli ne
Ġlin e
E vent
Even t
Ev ent
_ D
Ġ does
Ġd oes
Ġdo es
Ġdoe s
it ial
iti al
itia l
Ġ cr
Ġc r
a rs
ar s
Ġ tem
Ġt em
Ġte m
c ause
ca use
f ace
fa ce
fac e
Ġ `
_ A
B utton
But ton
a ture
at ure
atur e
atu re
ect ed
ec ted
E S
i ster
is ter
ist er
iste r
ĉ Ċ
Ġ before
Ġb efore
Ġbe fore
Ġbef ore
a le
al e
o ther
ot her
oth er
Ġ because
Ġb ecause
Ġbe cause
Ġbec ause
r oid
ro id
roi d
Ġ ed
Ġe d
i k
r eg
re g
Ġ De
ĠD e
Ġ dist
Ġd ist
Ġdis t
Ġdi st
} ,Ċ
}, Ċ
Ġ state
Ġs tate
Ġst ate
Ġstat e
Ġsta te
Ġ cons
Ġc ons
Ġcon s
Ġco ns
r int
ri nt
rin t
a tt
at t
Ġ here
Ġh ere
Ġhe re
Ġher e
i ned
in ed
ine d
Ġ final
Ġf inal
Ġfin al
Ġfi nal
Ġfina l
Ġ ""
Ġ" "
K ey
Ke y
L O
Ġ del
Ġd el
Ġde l
p ty
pt y
th ing
thin g
Ġ And
ĠA nd
ĠAn d
Ġ run
Ġr un
Ġru n
Ġ X
y m
. app
.ap p
.a pp
Ġ very
Ġv ery
Ġver y
Ġve ry
c es
ce s
_ N
a red
ar ed
are d
w ard
wa rd
war d
l ist
li st
lis t
i ted
it ed
ite d
o log
ol og
olo g
it ch
B ox
Bo x
i fe
if e
Ġ ac
Ġa c
Ġ model
Ġm odel
Ġmod el
Ġmode l
Ġmo del
Ġ mon
Ġm on
Ġmo n
Ġ way
Ġw ay
Ġwa y
l ete
le te
let e
Ġ call
Ġc all
Ġcal l
Ġca ll
Ġ att
Ġa tt
Ġat t
Ġ cal
Ġc al
Ġca l
v ert
ver t
ve rt
Ġ dec
Ġd ec
Ġde c
l ease
le ase
lea se
o un
ou n
Ġ });Ċ
Ġ} );Ċ
Ġ}) ;Ċ
Ġ}); Ċ
f r
form ation
format ion
forma tion
e tail
et ail
eta il
Ġ num
Ġn um
Ġnu m
a j
qu ery
que ry
quer y
Ġ well
Ġw ell
Ġwe ll
Ġwel l
Ġ object
Ġo bject
Ġob ject
Ġobj ect
Ġobje ct
Ġobjec t
Ġ As
ĠA s
Ġ years
Ġy ears
Ġyear s
Ġye ars
C olor
Col or
Co lor
I S
Ġ default
Ġd efault
Ġde fault
Ġdef ault
W h
Ġ ins
Ġin s
Ġi ns
a int
ain t
ai nt
Ġ java
Ġj ava
Ġjav a
Ġja va
Ġ sim
Ġs im
Ġsi m
Ġ Ar
ĠA r
m on
mo n
t il
ti l
( );čĊ
() ;čĊ
(); čĊ
) :
S et
Se t
a tter
at ter
att er
atte r
Ġ view
Ġv iew
Ġvi ew
Ġvie w
Ġ pres
Ġp res
Ġpr es
Ġpre s
a rray
ar ray
arr ay
arra y
W e
A t
Ġ bel
Ġb el
Ġbe l
Ġ many
Ġm any
Ġman y
Ġma ny
M an
Ma n
e nder
en der
end er
ende r
Ġ being
Ġb eing
Ġbe ing
Ġbei ng
Ġ good
Ġg ood
Ġgo od
Ġgoo d
ĉ ĉĉĉĉĉ
ĉĉ ĉĉĉĉ
ĉĉĉĉ ĉĉ
ĉĉĉ ĉĉĉ
ĉĉĉĉĉ ĉ
a tional
at ional
ation al
atio nal
ati onal
w are
wa re
war e
. log
.l og
.lo g
{ čĊ
Ġ using
Ġu sing
Ġus ing
_ B
Ġ :=
Ġ: =
_ w
i sts
is ts
ist s
l ish
li sh
lis h
Ġ stud
Ġs tud
Ġst ud
Ġstu d
Ġ Al
ĠA l
Ġ gu
Ġg u
con fig
conf ig
u ring
ur ing
uri ng
t ime
ti me
tim e
o ken
ok en
oke n
am espace
ame space
ames pace
Ġ request
Ġre quest
Ġreq uest
Ġrequ est
Ġ child
Ġch ild
Ġchi ld
Ġ Ã
l ob
lo b
Ġ param
Ġp aram
Ġpar am
Ġpara m
Ġpa ram
Ġ }čĊ
Ġ} čĊ
Ġ echo
Ġe cho
Ġec ho
Ġech o
f unction
func tion
fun ction
**** ****************************
******** ************************
**************** ****************
************************ ********
**************************** ****
p s
E lement
El ement
Elem ent
Ele ment
a lk
al k
l ication
lic ation
li cation
lica tion
b y
S ize
Si ze
ra wing
raw ing
Ġ person
Ġp erson
Ġper son
Ġpers on
Ġperso n
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
\ n
o bject
ob ject
obj ect
i nce
in ce
inc e
E n
F ile
Fi le
Fil e
u f
f fect
ff ect
ffe ct
A C
Ġ style
Ġst yle
Ġsty le
Ġstyl e
sum mary
summ ary
Ġ que
Ġqu e
Ġq ue
_ r
Ġ ($
Ġ( $
M odel
Mode l
Mod el
Mo del
i dent
id ent
ide nt
iden t
Ġ method
Ġm ethod
Ġmet hod
Ġmeth od
I L
o tt
ot t
l ess
le ss
les s
I NG
IN G
Ġ ()
Ġ( )
Ġ expect
Ġex pect
Ġexp ect
y nc
yn c
p ackage
pack age
u rs
ur s
Ġ prot
Ġp rot
Ġpro t
Ġpr ot
. /
p re
pr e
Ġ )Ċ
Ġ) Ċ
m a
Ġ sur
Ġs ur
Ġsu r
Ġ found
Ġf ound
Ġfo und
Ġfou nd
In fo
Inf o
p ar
pa r
i mes
im es
ime s
. e
a ins
ain s
ai ns
Ġ post
Ġp ost
Ġpos t
Ġpo st
- d
o lean
ol ean
ole an
Ġ sl
Ġs l
P E
Ġ such
Ġs uch
Ġsu ch
Ġsuc h
s elect
se lect
sel ect
a iner
ain er
ai ner
aine r
Ġ think
Ġth ink
Ġthin k
Ġthi nk
Ġd iffer
Ġdif fer
Ġdi ffer
Ġdiff er
. r
/ **Ċ
/* *Ċ
/** Ċ
F F
o ol
oo l
p late
pl ate
plat e
pla te
q ual
qu al
qua l
Ġ For
ĠF or
ĠFo r
Ġ much
Ġm uch
Ġmu ch
Ġmuc h
u c
( new
(n ew
(ne w
od ule
odu le
Ġ som
Ġs om
Ġso m
Ġ http
Ġh ttp
Ġht tp
Ġhtt p
Ġ List
ĠL ist
ĠLi st
ĠLis t
Ġ count
Ġc ount
Ġco unt
Ġcoun t
Ġcou nt
Ġ inst
Ġin st
Ġi nst
Ġins t
c har
ch ar
cha r
m it
mi t
. id
.i d
a king
ak ing
aki ng
akin g
Ġ gener
Ġg ener
Ġge ner
Ġgen er
Ġgene r
p x
v ice
vi ce
vic e
_ data
_d ata
_dat a
_da ta
Ġ NULL
ĠN ULL
ĠNU LL
} čĊ
i dd
id d
ãĢ Ĥ
Ġ med
Ġm ed
Ġme d
o rg
or g
i der
id er
ide r
a che
ac he
ach e
w ork
wo rk
wor k
Ġ check
Ġc heck
Ġch eck
Ġche ck
w een
we en
Ġ ((
Ġ( (
t he
th e
a nts
an ts
ant s
> <
. B
- c
Ġ open
Ġo pen
Ġop en
Ġ est
Ġe st
Ġes t
Ġ ĠĠĠĠĠĠĠĊ
ĠĠ ĠĠĠĠĠĠĊ
ĠĠĠĠ ĠĠĠĠĊ
ĠĠĠĠĠĠĠĠ Ċ
ĠĠĠ ĠĠĠĠĠĊ
ĠĠĠĠĠĠĠ ĠĊ
ĠĠĠĠĠ ĠĠĠĊ
ĠĠĠĠĠĠ ĠĠĊ
Ġ next
Ġn ext
Ġne xt
Ġnex t
I M
Ñ Ĥ
O T
Ã ³
Ġ follow
Ġf ollow
Ġfol low
Ġfoll ow
con tent
cont ent
conte nt
Ġ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠ
Ġin clud
Ġincl ud
Ġinclu d
H E
Ġ Res
ĠR es
ĠRe s
Ġ href
Ġh ref
Ġhr ef
Ð ¸
Ġ car
Ġc ar
Ġca r
y pes
ype s
yp es
i mage
im age
ima ge
imag e
U n
Ġ bool
Ġb ool
Ġbo ol
Ġboo l
A D
Ġ game
Ġg ame
Ġgam e
Ġga me
. Form
.F orm
.For m
r ows
ro ws
row s
* /
ve lop
vel op
. Drawing
.D rawing
.Draw ing
Ġ path
Ġp ath
Ġpat h
Ġpa th
is ion
isi on
Ġ each
Ġe ach
Ġea ch
Ġ Pl
ĠP l
_ type
_t ype
_typ e
_ty pe
P ath
Pa th
Pat h
n ection
ne ction
nect ion
nec tion
Ġ av
Ġa v
' ).
') .
Ġ support
Ġs upport
Ġsu pport
Ġsup port
Ġsupp ort
E NT
EN T
r em
re m
" ).
") .
Ġ own
Ġo wn
Ġow n
Ġ cor
Ġc or
Ġco r
c ount
co unt
cou nt
m iss
mi ss
mis s
u ally
ual ly
Ġ mem
Ġm em
Ġme m
s td
st d
i ence
ie nce
ien ce
s earch
se arch
sea rch
" ĊĊ
"Ċ Ċ
F orm
For m
Fo rm
Ġ sex
Ġs ex
Ġse x
e name
en ame
ena me
Ġ sign
Ġs ign
Ġsi gn
Ġsig n
Ġ et
Ġe t
Ġ ĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠ ĠĠĠĠ
' ,'
', '
Ġ App
ĠA pp
ĠAp p
Ġ those
Ġth ose
Ġtho se
o ff
of f
Ġ err
Ġe rr
Ġer r
Ġ system
Ġs ystem
Ġsys tem
Ġsy stem
Ġsyst em
Ġ best
Ġb est
Ġbe st
Ġbes t
c ode
co de
cod e
Ġ same
Ġs ame
Ġsa me
Ġsam e
Ġ di
Ġd i
u ss
us s
Ġ create
Ġc reate
Ġcre ate
Ġcreat e
Ġcrea te
a ther
at her
ath er
athe r
A rray
Ar ray
Arr ay
. in
.i n
f e
S ervice
Ser vice
Serv ice
U N
a ts
at s
Ġ Z
al th
alt h
Ġ made
Ġm ade
Ġma de
Ġmad e
tr ue
tru e
A B
Ġ mark
Ġm ark
Ġmar k
Ġma rk
r id
ri d
if ied
ifi ed
ifie d
, čĊ
y n
p ress
pr ess
pre ss
pres s
Ġ group
Ġg roup
Ġgr oup
Ġgro up
Ġgrou p
Ġ fin
Ġf in
Ġfi n
Ġ License
ĠL icense
ĠLic ense
F ield
Fi eld
e ger
eg er
ege r
Ġ world
Ġw orld
Ġwor ld
i ness
in ess
ine ss
ines s
t y
Ġ process
Ġp rocess
Ġpro cess
Ġproc ess
Ġproces s
( b
Ġ cre
Ġc re
Ġcr e
a rn
ar n
i ves
iv es
ive s
Ġ main
Ġm ain
Ġma in
Ġmai n
i deo
id eo
ide o
_ g
A G
val id
va lid
i mg
im g
P I
Ġ color
Ġc olor
Ġco lor
Ġcol or
Ġ report
Ġre port
Ġrep ort
Ġrepo rt
Ġrepor t
Ġ take
Ġt ake
Ġta ke
Ġtak e
r ib
ri b
O M
Ġ day
Ġd ay
Ġda y
Re quest
Req uest
Ġ sk
Ġs k
b ers
ber s
be rs
ĉ s
. Add
.A dd
.Ad d
o ot
oo t
I mage
Im age
Ġcom ple
Ġcomp le
Ġcompl e
ol lection
oll ection
ollect ion
olle ction
Ġ top
Ġt op
Ġto p
Ġ free
Ġf ree
Ġfr ee
Ġfre e
A S
D e
Ġ On
ĠO n
I G
e ta
et a
D ate
Da te
Dat e
Ġ action
Ġa ction
Ġact ion
Ġac tion
O ver
i tor
it or
ito r
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
n ot
no t
Ġ index
Ġin dex
Ġind ex
Ġinde x
h er
he r
i con
ic on
ico n
O n
; čĊčĊ
;čĊ čĊ
iv ity
ivi ty
m and
man d
ma nd
. Windows
.W indows
.Window s
O L
Ġ real
Ġre al
Ġ max
Ġm ax
Ġma x
l and
la nd
lan d
. ...
.. ..
... .
r aph
ra ph
rap h
Ġ build
Ġb uild
Ġbu ild
l eg
le g
as sword
ass word
? ĊĊ
?Ċ Ċ
âĢ ¦
o ok
oo k
u ck
uc k
Ġ message
Ġm essage
Ġmess age
t est
te st
tes t
i vers
iv ers
ive rs
iver s
Ġ input
Ġin put
Ġinp ut
Ġ art
Ġa rt
Ġar t
Ġ between
Ġb etween
Ġbet ween
G et
Ge t
en ter
ent er
ente r
g round
gr ound
gro und
e ne
en e
Ã ¡
. length
.l ength
.le ngth
N ode
No de
( i
C lass
Cl ass
Cla ss
f or
fo r
Ġ âĢĶ
ĠâĢ Ķ
t en
te n
o in
oi n
Ġ ke
Ġk e
u i
Ġ IN
ĠI N
Ġ table
Ġt able
Ġtab le
Ġta ble
s ub
su b
Ġ Le
ĠL e
Ġ head
Ġh ead
Ġhe ad
Ġ must
Ġm ust
Ġmus t
Ġmu st
//// ////////////
//////// ////////
//////////// ////
. util
.u til
.ut il
Cont ext
Con text
Ġ order
Ġor der
Ġord er
Ġ mov
Ġm ov
Ġmo v
o ver
ov er
ove r
Ġ contin
Ġc ontin
Ġcon tin
Ġcont in
Ġ say
Ġs ay
Ġsa y
st atic
stat ic
sta tic
. Text
.T ext
.Te xt
Ġ className
Ġclass Name
p any
pan y
pa ny
Ġ ter
Ġt er
Ġte r
h ead
he ad
hea d
r g
Ġ product
Ġpro duct
Ġprodu ct
Ġprod uct
Ġproduc t
T his
Th is
. âĢĿ
Ġ But
ĠB ut
ĠBu t
l oy
lo y
Ġ double
Ġd ouble
Ġdo uble
Ġdoub le
Ġdou ble
s g
Ġ place
Ġp lace
Ġpl ace
Ġplac e
Ġpla ce
. x
m essage
mess age
Ġ information
Ġin formation
Ġinform ation
Ġinformat ion
Ġinforma tion
pr ivate
priv ate
pri vate
Ġ oper
Ġo per
Ġop er
c ed
ce d
d b
" ></
"> </
">< /
P aram
Par am
Pa ram
Para m
i cle
ic le
icl e
Ġ week
Ġw eek
Ġwe ek
Ġwee k
Ġ prop
Ġp rop
Ġpro p
Ġpr op
t able
ta ble
tab le
tabl e
id get
idge t
p lace
pl ace
pla ce
P rop
Pro p
Pr op
Ġ All
ĠA ll
ĠAl l
e ls
el s
b ox
bo x
. ĊĊĊĊ
.ĊĊ ĊĊ
.Ċ ĊĊĊ
.ĊĊĊ Ċ
. R
Ġ To
ĠT o
i ter
it er
ite r
S h
u ration
ur ation
ura tion
urat ion
o lder
ol der
old er
_ list
_l ist
_li st
c ome
com e
co me
Ġ sw
Ġs w
iz ation
iza tion
ĉ for
ĉf or
b l
Ġ program
Ġp rogram
Ġpro gram
Ġpr ogram
Ġprog ram
Ġprogra m
Ġprogr am
( e
a pe
ap e
c heck
ch eck
che ck
. Forms
.Form s
.For ms
Ġ und
Ġu nd
Ġun d
ateg ory
ategor y
atego ry
a gs
ag s
Ġ response
Ġres ponse
Ġrespons e
Ġrespon se
U S
re quest
req uest
requ est
Ġ struct
Ġst ruct
Ġstr uct
Ġstruc t
e scription
es cription
Ġ code
Ġc ode
Ġco de
Ġcod e
_ H
u ffer
uff er
uf fer
Ġ without
Ġwith out
l obal
lo bal
lob al
M anager
Man ager
Manage r
Mana ger
il ter
ilt er
P O
ĉ this
ĉt his
ĉth is
o ption
op tion
opt ion
Ġ sol
Ġs ol
Ġso l
Ġ ===
Ġ= ==
Ġ== =
a kes
ak es
ake s
Cont roller
Control ler
Contr oller
M essage
Mess age
Ġ ref
Ġre f
Ġr ef
e ver
ev er
eve r
Ġ So
ĠS o
a ining
ain ing
ai ning
. append
.app end
.ap pend
Ġ still
Ġs till
Ġst ill
Ġstil l
Ġsti ll
Ġpro vid
Ġpr ovid
Ġprov id
Ġ assert
Ġas sert
Ġass ert
m ed
me d
Ġ cap
Ġc ap
Ġca p
us iness
usi ness
Ġ rep
Ġre p
Ġr ep
t ings
ting s
tin gs
v ed
ve d
. N
a pi
ap i
O D
Ġ field
Ġf ield
Ġfi eld
Ġfie ld
Ġfiel d
i ven
iv en
ive n
o to
ot o
âĢ ľ
c ol
co l
( x
g ht
gh t
Res ult
C ode
Co de
Cod e
. is
.i s
l ink
li nk
lin k
Ġ cour
Ġc our
Ġco ur
Ġcou r
A n
Ġ team
Ġt eam
Ġte am
Ġtea m
ĉ int
ĉi nt
ĉin t
i ft
if t
Ġ second
Ġse cond
Ġsec ond
Ġsecon d
Ġ going
Ġgo ing
Ġ range
Ġr ange
Ġran ge
Ġra nge
Ġrang e
_ E
n ess
ne ss
nes s
Ġf am
Ġfa m
Ġ nil
Ġn il
Ġni l
Ġ Cont
ĠC ont
ĠCon t
ĠCo nt
ail able
u tes
ut es
ute s
a tab
at ab
ata b
Ġ fact
Ġf act
Ġfa ct
Ġfac t
Ġ vis
Ġv is
Ġvi s
( &
Ġ AN
ĠA N
A l
t itle
ti tle
tit le
Ġ android
Ġand roid
C E
\ "
i rt
ir t
Ġw rit
Ġwr it
Ð ½
ĉ m
ft ware
o nd
on d
Ġ ret
Ġre t
Ġr et
os ition
osi tion
osit ion
Ġ home
Ġh ome
Ġhom e
Ġho me
Ġ left
Ġl eft
Ġle ft
ar gs
arg s
m eric
mer ic
me ric
Ġ direct
Ġd irect
Ġdi rect
Ġdir ect
Ġdire ct
Ġdirec t
o ci
oc i
P l
A s
r et
re t
a do
ad o
O f
c hn
ch n
Ġ Get
ĠG et
ĠGe t
e e
r oss
ro ss
ros s
( );
() ;
_ ___
__ __
___ _
. ph
.p h
I t
o ute
ou te
out e
Ġex per
Ġexp er
ch ool
cho ol
w ww
ww w
} ,
Ġ allow
Ġal low
Ġall ow
Ġallo w
Ġ Â
( ))
() )
s ize
si ze
i sm
is m
a i
t ract
tr act
tra ct
a ne
an e
. ..ĊĊ
.. .ĊĊ
... ĊĊ
...Ċ Ċ
con text
cont ext
conte xt
Ġ beg
Ġb eg
Ġbe g
C H
Ġ page
Ġp age
Ġpa ge
Ġpag e
h ip
hi p
n o
c ore
co re
cor e
s p
Ġ different
Ġd ifferent
Ġdiffer ent
Ġdifferen t
i able
ia ble
Ġ Me
ĠM e
_ IN
_I N
b utton
but ton
butt on
Ġ Is
ĠI s
erv ices
ervice s
Ġ ca
Ġc a
Ġ around
Ġa round
Ġar ound
Ġarou nd
A pp
Ap p
r ation
ra tion
rat ion
ratio n
Ġ rece
Ġre ce
Ġr ece
Ġrec e
Ġ really
Ġre ally
Ġreal ly
Ġ image
Ġi mage
Ġim age
Ġimag e
Ġima ge
Ġ target
Ġt arget
Ġtar get
Ġtarg et
Ġ dep
Ġd ep
Ġde p
op yright
opy right
t ra
tr a
i ngle
in gle
ing le
i tal
it al
ita l
L ayout
La yout
Ġ both
Ġb oth
Ġbo th
Ġbot h
Over ride
a rm
ar m
= >
at erial
ate rial
ater ial
ateria l
i led
il ed
ile d
Ġ put
Ġp ut
Ġpu t
Q u
Ñ Ģ
u ng
un g
m ap
ma p
ĉ ĉĉĉĉĉĉĉ
ĉĉ ĉĉĉĉĉĉ
ĉĉĉĉ ĉĉĉĉ
ĉĉĉ ĉĉĉĉĉ
ĉĉĉĉĉ ĉĉĉ
ĉĉĉĉĉĉ ĉĉ
ĉĉĉĉĉĉĉ ĉ
Ġ level
Ġle vel
Ġlev el
Ġleve l
Com ponent
Comp onent
b ook
bo ok
boo k
c reen
cre en
cr een
_ RE
_R E
Ġ config
Ġcon fig
Ġconf ig
Ġconfi g
ã ģ
O r
. data
.d ata
.dat a
.da ta
Ġ document
Ġd ocument
Ġdoc ument
" ,"
", "
trib ute
u x
L og
Lo g
fer ence
fe rence
feren ce
p ost
pos t
po st
_ e
Ġ local
Ġl ocal
Ġlo cal
Ġloc al
an dom
and om
ando m
as sert
ass ert
asse rt
asser t
V al
Va l
l ected
lect ed
lec ted
i na
in a
ata base
atab ase
A dd
Ad d
Ġ content
Ġcon tent
Ġcont ent
Ġconten t
Ġconte nt
. print
.p rint
.pr int
s igned
sign ed
sig ned
r ic
ri c
. "ĊĊ
." ĊĊ
."Ċ Ċ
Ġ fa
Ġf a
! ĊĊ
!Ċ Ċ
- f
i ved
iv ed
ive d
Ġ quest
Ġqu est
Ġque st
Ġq uest
Ġques t
. ex
.e x
Ġ float
Ġf loat
Ġflo at
Ġ develop
Ġde velop
Ġdeve lop
Ġdevel op
Ð¾ Ð
M ap
Ma p
a ding
ad ing
adi ng
adin g
Ġ poss
Ġp oss
Ġpos s
Ġpo ss
U E
n amespace
name space
names pace
nam espace
_ O
ĉ b
. Get
.G et
.Ge t
> (
j son
js on
e tails
et ails
etail s
eta ils
Ġ too
Ġt oo
Ġto o
Ġ extends
Ġext ends
Ġextend s
Ġexten ds
Ġ None
ĠN one
ĠNo ne
ĠNon e
Ġ fore
Ġf ore
Ġfor e
Ġfo re
( String
(S tring
(Str ing
form at
for mat
forma t
Ġ great
Ġg reat
Ġgr eat
Ġgre at
in ter
int er
inte r
c ale
ca le
cal e
Ñ ģ
r on
ro n
i ving
iv ing
ivi ng
E nt
En t
e ncy
en cy
enc y
x t
o y
Ġ month
Ġm onth
Ġmon th
Ġmo nth
Ġmont h
Ġh app
Ġha pp
Ġhap p
Ġ super
Ġs uper
Ġsu per
Ġsup er
b ar
ba r
d efault
de fault
def ault
_ de
_d e
or ds
ord s
l n
( {Ċ
({ Ċ
Ġ Ind
ĠI nd
ĠIn d
a ses
as es
ase s
Ġ title
Ġt itle
Ġtit le
Ġti tle
Ġ context
Ġcon text
Ġcont ext
Ġconte xt
Ġcontex t
o h
- p
E m
Ġ met
Ġm et
Ġme t
T est
Te st
Tes t
Ġ life
Ġl ife
Ġli fe
Ġlif e
_ v
Ġ US
ĠU S
U I
o cation
oc ation
oca tion
m d
Ġ [Ċ
Ġ[ Ċ
Ġ ]
s w
Ġ incre
Ġin cre
Ġinc re
Ġincr e
s cript
scri pt
scr ipt
ent ial
enti al
w ays
way s
wa ys
. de
.d e
Ġ src
Ġs rc
Ġsr c
Ġ catch
Ġc atch
Ġcat ch
Ġ Americ
ĠA meric
ĠAm eric
ĠAmer ic
/ /Ċ
// Ċ
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġ pay
Ġp ay
Ġpa y
p lit
pl it
pli t
âĢ Ķ
Ġc oun
Ġco un
Ġcou n
o bj
ob j
. php
.p hp
.ph p
Ġ change
Ġch ange
Ġchang e
Ġcha nge
Ġchan ge
e thing
eth ing
' re
'r e
a ster
as ter
ast er
aste r
l os
lo s
l ation
la tion
lat ion
Ġ ĠĊ
ĠĠ Ċ
L e
Ã ¤
( {
re ady
read y
rea dy
Ġ No
ĠN o
Ġ position
Ġp osition
Ġpos ition
Ġposit ion
Ġposi tion
Ġpositi on
Ġ old
Ġo ld
Ġol d
Ġ book
Ġb ook
Ġbo ok
Ġboo k
a bled
ab led
able d
abl ed
b ug
bu g
H and
Ha nd
Han d
} ;ĊĊ
};Ċ Ċ
}; ĊĊ
is play
isp lay
a ving
av ing
avi ng
avin g
Ġg over
Ġgo ver
Ġgov er
Ġ version
Ġv ersion
Ġvers ion
S ystem
Sys tem
Sy stem
n ect
ne ct
nec t
res ponse
respons e
St yle
U p
an gu
ang u
Ġ three
Ġth ree
Ġthr ee
i nit
in it
ini t
e ro
er o
Ġ law
Ġl aw
Ġla w
en dif
end if
endi f
Ġ base
Ġb ase
Ġbas e
Ġba se
e mail
em ail
ema il
( l
_ V
Ġ conf
Ġcon f
Ġco nf
A TE
AT E
Ġ during
Ġd uring
Ġdu ring
Ġdur ing
t es
te s
Ġ console
Ġcon sole
Ġcons ole
Ġconsol e
Ġ Pr
ĠP r
Ġ spe
Ġs pe
Ġsp e
v es
ve s
p ath
pat h
pa th
i alog
ial og
ia log
d ition
di tion
dit ion
_ to
_t o
ar ds
ard s
Ġ against
Ġagain st
et work
Ġ Ph
ĠP h
_ L
c ur
cu r
i mit
im it
imi t
W ith
Wi th
Ġ power
Ġp ower
Ġpo wer
Ġpow er
i um
iu m
' ;ĊĊ
';Ċ Ċ
'; ĊĊ
Ġw om
Ġwo m
l eft
le ft
lef t
our ces
ource s
a tri
at ri
atr i
Ġ Im
ĠI m
Ġ Man
ĠM an
ĠMa n
or th
ort h
$ {
qu als
qual s
qua ls
e se
es e
_ size
_s ize
_si ze
Ġ iss
Ġis s
Ġi ss
o tal
ot al
ota l
- g
i que
iqu e
iq ue
r ame
ra me
ram e
Ġ width
Ġw idth
Ġwid th
e rg
er g
) (
it tle
itt le
T R
Ġ They
ĠT hey
ĠThe y
ĠTh ey
e nces
en ces
ence s
enc es
r l
o ns
on s
Ġ label
Ġl abel
Ġla bel
Ġlab el
. y
- t
up date
upd ate
a nel
an el
ane l
s c
. to
.t o
Ġ project
Ġpro ject
Ġproj ect
Ġprojec t
Ġproje ct
Ã ¼
Ġ element
Ġe lement
Ġel ement
Ġele ment
Ġelem ent
Ġ success
Ġs uccess
Ġsu ccess
Ġsuc cess
Ġsucc ess
Ġsucces s
ĉ ĉĊ
ĉĉ Ċ
. sh
.s h
r am
ra m
c hed
ch ed
che d
( ))Ċ
() )Ċ
()) Ċ
Ġ (Ċ
Ġ( Ċ
Ġ date
Ġd ate
Ġda te
Ġdat e
Ġ tot
Ġt ot
Ġto t
_ ST
_S T
A ll
Al l
i fication
if ication
ific ation
ifi cation
ifica tion
ĉ var
ĉv ar
ĉva r
Ġ tri
Ġt ri
Ġtr i
c hem
ch em
che m
m y
Ġ big
Ġb ig
Ġbi g
Ġ Ad
ĠA d
Ġ At
ĠA t
o ts
ot s
n um
nu m
A ct
Ac t
Ġ map
Ġm ap
Ġma p
e ra
er a
c ope
co pe
cop e
. $
, âĢĿ
Ġ pop
Ġp op
Ġpo p
Ġ few
Ġf ew
Ġfe w
Ġ len
Ġl en
Ġle n
u id
ui d
e ters
et ers
eter s
ete rs
u les
ul es
ule s
Ã Ń
s ource
ht tps
http s
htt ps
Ġ dem
Ġd em
Ġde m
Ġ ear
Ġe ar
Ġea r
#### ############
######## ########
############ ####
Ġ match
Ġm atch
Ġmat ch
o ries
or ies
ori es
orie s
a ces
ace s
ac es
Ġ Cl
ĠC l
Ġ node
Ġn ode
Ġno de
Ġnod e
i rc
ir c
l ocal
lo cal
loc al
un ity
unit y
uni ty
} ;Ċ
}; Ċ
Ġ another
Ġan other
Ġano ther
< <
o gle
og le
ogl e
Ġ sit
Ġs it
Ġsi t
e work
ew ork
T E
. I
N S
o logy
ol ogy
olog y
olo gy
o ught
ou ght
ough t
oug ht
. Cont
.C ont
.Con t
.Co nt
> >
Ġ care
Ġc are
Ġcar e
Ġca re
s tate
st ate
stat e
sta te
ĉ private
ĉpr ivate
ĉpriv ate
Ġ effect
Ġe ffect
Ġeff ect
Ġef fect
Ġeffec t
+ +)
++ )
_ file
_f ile
_fil e
en ding
end ing
endi ng
L ine
Li ne
Lin e
F or
Fo r
i or
io r
Ġ Sc
ĠS c
Ġ fun
Ġf un
Ġfu n
. Size
.S ize
ĉ else
ĉe lse
ĉel se
] )
st art
star t
sta rt
v ious
vi ous
vio us
Ġ },
Ġ} ,
o urs
ou rs
our s
Ġ leg
Ġl eg
Ġle g
Ġ service
Ġs ervice
Ġser vice
Ġserv ice
Ġservi ce
Ġservic e
Ġ since
Ġs ince
Ġsi nce
Ġsin ce
Ġsinc e
i ron
ir on
iro n
L abel
La bel
Lab el
Ġ non
Ġn on
Ġno n
Ġ los
Ġl os
Ġlo s
i ction
ic tion
ict ion
Ġ full
Ġf ull
Ġful l
Ġfu ll
a cter
act er
ac ter
b oard
bo ard
boa rd
g ress
gr ess
gre ss
gres s
Ġ turn
Ġt urn
Ġtu rn
Ġtur n
i ther
it her
ith er
ithe r
. size
.s ize
.si ze
Ġ body
Ġb ody
Ġbo dy
Ġbod y
r esh
re sh
res h
e turn
et urn
etur n
etu rn
( _
y les
yle s
yl es
or mal
orm al
p i
Ġ something
Ġs omething
Ġsome thing
Ġsom ething
! --
u int
ui nt
uin t
Ġ produ
Ġp rodu
Ġpro du
Ġpr odu
Ġprod u
Ġ stand
Ġst and
Ġsta nd
Ġstan d
Ġ proble
Ġpro ble
Ġpr oble
Ġprob le
Ġprobl e
Ġ available
Ġav ailable
Ġavail able
m t
Ġ Bl
ĠB l
Ġ ...
Ġ. ..
Ġ.. .
Ġ block
Ġb lock
Ġbl ock
Ġblo ck
Ġbloc k
In put
Ġ keep
Ġk eep
Ġke ep
C ount
Co unt
Cou nt
o pen
op en
ope n
Ġ ['
Ġ[ '
Ġ throw
Ġth row
Ġthr ow
Ġthro w
u ilder
uild er
ui lder
uil der
A ction
Act ion
Ac tion
Ġ things
Ġth ings
Ġthing s
Ġthin gs
Tr ue
Ġ url
Ġu rl
Ġur l
Ġ Bo
ĠB o
print f
prin tf
Ġ red
Ġre d
Ġr ed
j s
. create
.c reate
Ġ Or
ĠO r
S tatus
St atus
Stat us
In stance
Inst ance
Ġ control
Ġc ontrol
Ġcont rol
Ġcontr ol
Ġcontro l
Ġ come
Ġc ome
Ġcom e
Ġco me
Ġ custom
Ġc ustom
Ġcust om
Ġcus tom
Ġcusto m
l ocation
lo cation
loc ation
m odel
mod el
mo del
mode l
Ġ čĊ
Ġ source
Ġs ource
Ġsour ce
Ġe as
Ġea s
. out
.o ut
] ĊĊ
]Ċ Ċ
o ney
on ey
one y
Ġ await
Ġa wait
Ġaw ait
Ġp artic
Ġpart ic
Ġpar tic
Ġparti c
A P
ub lish
ubl ish
o des
od es
ode s
_ pro
_p ro
_pr o
p ly
pl y
r iter
ri ter
rit er
rite r
Ġ prov
Ġp rov
Ġpro v
Ġpr ov
Ġ mill
Ġm ill
Ġmil l
Ġmi ll
H T
] )Ċ
]) Ċ
Ġ chang
Ġc hang
Ġch ang
Ġcha ng
Ġchan g
Ġ ask
Ġa sk
Ġas k
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
Ġ output
Ġout put
Ġ email
Ġe mail
Ġem ail
. push
.p ush
Ġ }čĊčĊ
Ġ} čĊčĊ
Ġ}čĊ čĊ
i nation
in ation
ina tion
inati on
at rix
atri x
atr ix
T able
Tab le
Ta ble
u ccess
uc cess
ucc ess
] );Ċ
]) ;Ċ
]); Ċ
Ġ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
ĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
Ġ disc
Ġd isc
Ġdis c
Ġdi sc
( [
Ġ business
Ġb usiness
Ġbus iness
h eight
he ight
hei ght
. html
.h tml
.ht ml
.htm l
t a
f ield
fi eld
fie ld
Ġ required
Ġre quired
Ġrequire d
Ġrequ ired
_ R
Ġg overn
Ġgo vern
Ġgover n
Ġgov ern
} čĊčĊ
}čĊ čĊ
l ex
le x
. ,
Ġ Set
ĠS et
ĠSe t
u rch
ur ch
/ //
// /
t s
a f
Ġ might
Ġm ight
Ġmi ght
Ġmig ht
i story
is tory
ist ory
istor y
isto ry
S tr
St r
Ġ never
Ġn ever
Ġne ver
Ġnev er
Res ponse
Respons e
ar se
ars e
a da
ad a
Ġ How
ĠH ow
ĠHo w
Ġ *)
Ġ* )
Ġ ;
Ġ hard
Ġh ard
Ġhar d
Ġha rd
A d
Ġ intern
Ġin tern
Ġint ern
Ġinter n
Ġinte rn
u sed
us ed
use d
( data
(d ata
(dat a
(da ta
m od
mo d
an nel
ann el
anne l
Ġ np
Ġn p
u gg
ug g
Ġ />Ċ
Ġ/ >Ċ
Ġ/> Ċ
Ġ called
Ġc alled
Ġcall ed
Ġcal led
Ġcalle d
b ody
bo dy
Ġ cho
Ġc ho
Ġch o
( r
_ set
_s et
_se t
i rd
ir d
Ġ >=
Ġ> =
Ġ };Ċ
Ġ} ;Ċ
Ġ}; Ċ
Ġ options
Ġo ptions
Ġop tions
Ġoption s
Ġopt ions
Ġ Gener
ĠG ener
ĠGe ner
ĠGen er
ĠGene r
Ġ height
Ġh eight
Ġhe ight
Ġhei ght
P oint
Po int
Y ou
Yo u
e ty
et y
C lick
Cl ick
Cli ck
Ġ small
Ġs mall
Ġsm all
Ġ ide
Ġi de
Ġid e
Ġ access
Ġa ccess
Ġacc ess
Ġac cess
Ġacces s
angu age
Ġ protected
Ġprot ected
Ġprotect ed
Ġprotec ted
Ġ job
Ġj ob
Ġjo b
Ġ There
ĠT here
ĠThe re
ĠTh ere
ĠTher e
D ef
De f
Ġ address
Ġadd ress
Ġad dress
Ġaddr ess
Ġ uint
Ġu int
Ġui nt
N ot
No t
o o
a ps
ap s
< div
<d iv
a ined
ain ed
ai ned
aine d
a tur
at ur
atu r
Ġ sum
Ġs um
Ġsu m
- w
Ġ Date
ĠD ate
ĠDa te
ĠDat e
Ġ little
Ġl ittle
Ġlit tle
Ġlitt le
Ġ fri
Ġf ri
Ġfr i
Y PE
YP E
Ġ port
Ġp ort
Ġpo rt
Ġpor t
e h
p ring
pr ing
pri ng
prin g
_ path
_p ath
_pa th
_pat h
Ġ status
Ġs tatus
Ġst atus
Ġstat us
a im
ai m
b ool
bo ol
boo l
Ġ appe
Ġa ppe
Ġapp e
Ġap pe
Ġ os
Ġo s
. name
.n ame
ens ion
ensi on
_ G
Ġ update
Ġup date
Ġupd ate
Con fig
Conf ig
a ff
af f
E RR
ER R
Ġ <=
Ġ< =
at ely
ate ly
atel y
# if
u ction
uct ion
uc tion
Ġ Te
ĠT e
Ġ link
Ġl ink
Ġli nk
Ġlin k
Ġ User
ĠU ser
ĠUs er
ĠUse r
. find
.f ind
.fi nd
.fin d
. org
.o rg
.or g
m e
Ġ given
Ġg iven
Ġgive n
Ġgi ven
O ut
Ou t
# endif
Ġ better
Ġb etter
Ġbe tter
Ġbet ter
P age
Pa ge
Pag e
Ġ feel
Ġf eel
Ġfe el
Ġfee l
e nn
en n
M L
Ġ already
Ġal ready
Ġ including
Ġin cluding
Ġinclud ing
Ġincl uding
Ġinclu ding
o ogle
oo gle
oog le
r u
ic ally
ical ly
p rop
pr op
pro p
l ean
le an
lea n
o uter
ou ter
out er
oute r
Ġ always
Ġal ways
or ding
ord ing
ordin g
ordi ng
I f
o rage
or age
ora ge
Ġ parent
Ġp arent
Ġpar ent
Ġpa rent
Ġpare nt
Ġparen t
v is
vi s
ĉ ĉĉĉĉĉĉ
ĉĉ ĉĉĉĉĉ
ĉĉĉĉ ĉĉĉ
ĉĉĉ ĉĉĉĉ
ĉĉĉĉĉ ĉĉ
ĉĉĉĉĉĉ ĉ
Ġ got
Ġg ot
Ġgo t
st and
sta nd
stan d
Ġ less
Ġl ess
Ġle ss
Ġles s
/ s
Ġ Ass
ĠA ss
ĠAs s
a pt
ap t
i red
ir ed
ire d
Ġ Add
ĠA dd
ĠAd d
Ġ account
Ġa ccount
Ġacc ount
Ġac count
p loy
pl oy
plo y
Ġ der
Ġd er
Ġde r
re sent
res ent
rese nt
Ġ lot
Ġl ot
Ġlo t
Ġ valid
Ġval id
Ġva lid
ĉ d
Ġ bit
Ġb it
Ġbi t
p onents
pon ents
ponent s
pone nts
Ġ following
Ġfollow ing
Ġfoll owing
_ ex
_e x
S ON
SO N
Ġ sure
Ġs ure
Ġsu re
Ġsur e
o cial
oc ial
oci al
ocia l
Ġ prom
Ġp rom
Ġpro m
Ġpr om
er ties
ert ies
erti es
he ader
head er
hea der
. pro
.p ro
.pr o
Ġ boolean
Ġbo olean
Ġbool ean
Ġboo lean
Ġ search
Ġs earch
Ġse arch
Ġsea rch
k en
ke n
Ġ orig
Ġo rig
Ġor ig
Ġori g
Ġ er
Ġe r
E d
E M
a ut
au t
l ing
li ng
lin g
al ity
ali ty
By Id
b ed
be d
ĉ case
ĉc ase
e ther
et her
eth er
ethe r
p osit
pos it
po sit
posi t
Ġ invest
Ġin vest
Ġinv est
Ġinve st
Ġinves t
Ġ OR
ĠO R
Ġ says
Ġs ays
Ġsa ys
Ġsay s
m ission
miss ion
A ME
AM E
Ġ temp
Ġt emp
Ġte mp
Ġtem p
o ad
oa d
Ġ rest
Ġre st
Ġr est
Ġres t
in fo
inf o
Ġ interest
Ġinter est
Ġinte rest
Ġinteres t
A rg
Ar g
Ġ perform
Ġper form
Ġperf orm
Ġperfor m
p ons
pon s
po ns
Ġ View
ĠV iew
ĠVi ew
ĠVie w
Ġ ver
Ġv er
Ġve r
l ib
li b
( const
(con st
(co nst
U til
Ut il
List ener
Listen er
ar ge
arg e
Ġ mult
Ġm ult
Ġmu lt
Ġmul t
Ġ die
Ġd ie
Ġdi e
Ġ site
Ġs ite
Ġsit e
Ġsi te
.. /../
../ ../
E L
Ġ values
Ġvalue s
Ġval ues
Ġvalu es
Ġ })Ċ
Ġ} )Ċ
Ġ}) Ċ
p en
pe n
N o
i cro
ic ro
Ġ beh
Ġb eh
Ġbe h
Ġ' ./
Ġ'. /
a cy
ac y
r ec
re c
( )->
() ->
()- >
ĉ ĠĠĠ
ĉĠ ĠĠ
ĉĠĠ Ġ
" ))
") )
Cont ent
Con tent
_ W
p lement
pl ement
ple ment
Ġ won
Ġw on
Ġwo n
Ġ video
Ġv ideo
Ġvi deo
Ġvid eo
Ġvide o
a di
ad i
p oint
po int
poi nt
% %
Ġ gl
Ġg l
er ved
erv ed
erve d
v iron
vi ron
vir on
I F
u ted
ut ed
ute d
ã ĥ
' m
Ġ cert
Ġc ert
Ġce rt
Ġcer t
Ġ prof
Ġpro f
Ġpr of
Ġ cell
Ġc ell
Ġce ll
Ġcel l
a ri
ar i
Ġ player
Ġp layer
Ġpl ayer
Ġplay er
Ġpla yer
a is
ai s
Ġ cost
Ġc ost
Ġco st
Ġcos t
Ġ hum
Ġh um
Ġhu m
( R
Ġo ffic
Ġof fic
Ġoff ic
k s
. text
.t ext
.te xt
.tex t
a tures
at ures
ature s
atur es
atu res
Ġ total
Ġt otal
Ġto tal
Ġtot al
Ġ */ĊĊ
Ġ* /ĊĊ
Ġ*/ ĊĊ
Ġ*/Ċ Ċ
o pe
op e
Ġ stat
Ġs tat
Ġst at
Ġsta t
U M
Ġ load
Ġl oad
Ġlo ad
ight s
igh ts
Ġ clear
Ġc lear
Ġcl ear
Ġcle ar
u ro
ur o
Ġ techn
Ġte chn
Ġtech n
Ġtec hn
u pport
up port
upp ort
I R
Ġ row
Ġr ow
Ġro w
Ġse em
Ġsee m
Ġ q
Ġ short
Ġs hort
Ġsh ort
Ġsho rt
Ġ Not
ĠN ot
ĠNo t
i pp
ip p
G roup
Gr oup
Gro up
s ection
se ction
sec tion
sect ion
m ax
ma x
i rl
ir l
Ġ override
Ġover ride
Ġ company
Ġcom pany
Ġcomp any
Ġcompan y
Ġ done
Ġd one
Ġdo ne
Ġdon e
" );čĊ
") ;čĊ
"); čĊ
Ġ gre
Ġg re
Ġgr e
. Re
.R e
Ġ belie
Ġbe lie
Ġbel ie
r ist
ri st
ris t
Ġ health
Ġhe alth
Ġheal th
A NT
AN T
( )ĊĊ
() ĊĊ
()Ċ Ċ
Ġ Be
ĠB e
. value
.v alue
.val ue
Ġ Gr
ĠG r
ot tom
ott om
otto m
Ġ args
Ġar gs
Ġarg s
P T
s tatus
st atus
stat us
f unc
fun c
fu nc
u ments
um ents
ument s
ume nts
umen ts
- h
N umber
Num ber
: čĊ
Ġ Log
ĠL og
ĠLo g
er ver
erv er
erve r
Ġ ),Ċ
Ġ) ,Ċ
Ġ), Ċ
a ment
am ent
ame nt
amen t
Ġ obj
Ġo bj
Ġob j
i nc
in c
Ġ children
Ġchild ren
i cy
ic y
I Z
a nds
an ds
and s
ab ly
abl y
Ġd istrib
Ġdis trib
Ġdist rib
Ġdistr ib
Ġ cur
Ġc ur
Ġcu r
e rial
er ial
eri al
eria l
Ġ days
Ġd ays
Ġday s
Ġda ys
r eated
re ated
reate d
reat ed
rea ted
r ect
re ct
rec t
- l
i rm
ir m
i dden
id den
idd en
o mb
om b
Ġ initial
Ġin itial
Ġinit ial
Ġiniti al
. js
.j s
Ġ â
Qu ery
Que ry
Quer y
Ġ online
Ġon line
i mal
im al
ima l
. con
.c on
.co n
a u
U rl
Ur l
c ontrol
cont rol
contr ol
contro l
i rection
ir ection
ire ction
irect ion
Ġ instance
Ġin stance
Ġinst ance
